In [11]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

import warnings
warnings.filterwarnings('ignore')

In [12]:
#identificar os dados.
dados = pd.read_csv("salaries.csv")
dados.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M

In [13]:
#Verificar a dimensão da tabela.
dados.shape

(3755, 11)

In [14]:
#Verificar o tipo de dados.
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3755 entries, 0 to 3754
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           3755 non-null   int64
 1   experience_level    3755 non-null   object
 2   employment_type     3755 non-null   object
 3   job_title           3755 non-null   object
 4   salary              3755 non-null   int64
 5   salary_currency     3755 non-null   object
 6   salary_in_usd       3755 non-null   int64
 7   employee_residence  3755 non-null   object
 8   remote_ratio        3755 non-null   int64
 9   company_location    3755 non-null   object
 10  company_size        3755 non-null   object
dtypes: int64(4), object(7)
memory usage: 322.8+ KB

In [16]:
dadados.rename(columns={
    'work_year':'Ano de Trabalho',
    'experience_level':'Nível de experiência',
    'employment_type':'Tipo de Emprego',
    'job_title':'Cargo',
    'salary':'Salário',
    'salary_currency':'salário_moeda',
    'salary_in_usd':'Salário em Dolar',
    'employee_residence':'Residência',
    'remote_ratio':'Relação remota',
    'company_location':'Localização empresa',
    'company_size':'Tamanho da empresa',
}, inplace=True)

dados.head()

AttributeError: 'NoneType' object has no attribute 'rename'